{
  "id": "fanfic",
  "name": "Fanfiction",
  "description": "For stories set in existing universes — tracks what you're keeping from canon, what you're changing, and what's original.",
  "canon_types": [
    {
      "id": "characters",
      "label": "Characters",
      "description": "All characters — both from the source material and original characters (OCs)"
    },
    {
      "id": "locations",
      "label": "Locations",
      "description": "Places where scenes happen — from the source material or invented"
    },
    {
      "id": "canon-deviations",
      "label": "Canon Deviations",
      "description": "Explicit changes from the source material — what's different and why"
    },
    {
      "id": "original-additions",
      "label": "Original Additions",
      "description": "New characters, locations, concepts, or rules not in the source material"
    },
    {
      "id": "source-reference",
      "label": "Source Reference",
      "description": "Key facts, events, and rules from the original work that this story depends on"
    }
  ],
  "themes": [
    "reinterpretation",
    "what if",
    "the spaces between scenes"
  ],
  "guide": "# Fanfiction Canon Guide\n\nFanfic operates in a unique space: your reader already knows the world. That's your superpower and your constraint. You don't need to explain Hogwarts, but you can't accidentally put the Great Hall on the wrong floor. This canon system helps you track what you're keeping, what you're changing, and what you're inventing.\n\n## Characters\n\nOne file per character. Mark each as **source**, **OC**, or **hybrid** (source character with significant reinterpretation).\n\n### For source material characters:\n\n- **Baseline**: The version from canon that you're starting from. Which book/episode/arc? This matters for characterization\n- **What you're keeping**: Core personality traits, relationships, speech patterns that readers expect\n- **What you're reinterpreting**: Where your version diverges — and *why*. \"This story explores what Draco would be like if he'd been sorted into Ravenclaw\" is a thesis statement\n- **Voice anchors**: 2-3 direct quotes from the source that capture how this character sounds. Your dialogue should feel like it belongs in the same room\n- **Relationship changes**: If you're shipping differently than canon, track who's with whom and the emotional logic\n\n### For OCs:\n\n- **Role justification**: Why does this character need to exist? What story function do they serve that no source character could?\n- **Integration**: How do they connect to the existing world? Family ties, shared history, institutional overlap\n- **Power calibration**: OCs that are stronger/smarter/more special than the source protagonists trigger reader resistance. Be deliberate about where your OC sits in the power hierarchy\n- **Voice contrast**: Make sure they don't sound like a source character wearing a different name\n\n## Locations\n\nOne file per significant location.\n\n- **Source or original**: Tag it clearly\n- **Source locations**: Note which details are canon and which you've embellished. \"The Shire has a pub called The Green Dragon\" is canon; the decor you describe is yours\n- **Original locations**: Explain how they fit into the existing geography/world. Where is this relative to places readers know?\n- **Atmosphere shifts**: If you're writing the same location in a different tone (dark!Hogwarts, post-apocalyptic Shire), document your atmospheric choices explicitly so they stay consistent\n\n## Canon Deviations\n\n**This is the most important canon type for fanfic.** One file per significant departure from source material.\n\n- **The original**: What happens in canon. Be specific — cite the book/episode/scene\n- **Your change**: What's different in your version\n- **Divergence type**:\n  - *AU premise*: \"What if X never happened?\" — the foundational change everything flows from\n  - *Fix-it*: \"X happened but Y is different because the original was unsatisfying\"\n  - *Expansion*: \"Canon is vague here, so I'm filling in the gaps\"\n  - *Contradiction*: \"I'm deliberately changing this for story reasons\" (own it)\n- **Downstream effects**: The most critical field. If you change one thing, what else has to change? If Sirius never goes to Azkaban, who raises Harry? Does Pettigrew get caught? Does the Order reform earlier?\n- **Reader expectation management**: Will readers notice this change immediately, or is it a slow reveal? Plan your disclosure\n\n## Original Additions\n\nOne file per new element you've added to the universe — spells, artifacts, institutions, cultural practices, species.\n\n- **What it is**: Clear description of the addition\n- **Integration logic**: How it fits into the existing world without contradicting established rules. \"Wizards have a postal system (owls), so a magical email system would feel redundant\" — this kind of reasoning prevents worldbuilding bloat\n- **Why it exists**: What story problem does this solve? If you invented a new spell, it should enable a plot point, not just be cool\n- **Tonal consistency**: Does this addition *feel* like it belongs in the source material? A cyberpunk gadget in Middle-earth needs very good justification\n- **Character interaction**: Who uses this? Who knows about it? Who's affected by it?\n\n## Source Reference\n\nOne file per key fact, event, or rule from the original work that your story depends on. This is your cheat sheet for not making continuity errors.\n\n- **The fact**: State it plainly\n- **Source**: Where in the original this is established (book, chapter, episode, scene)\n- **How your story uses it**: Why you're tracking this specific detail\n- **Reliability**: Is this Word of God, clearly shown in-text, fan consensus, or ambiguous? Ambiguous source details give you more room\n- **Dependencies**: Which of your characters, scenes, or plot points break if this fact is wrong?\n\nThis canon type exists because the most common fanfic mistake is misremembering a source detail and building a plot on it. When in doubt, check. When confident, double-check.\n\n## Brief vs. Extended Files\n\nCanon entries support two tiers. **Most beats should be writable from briefs alone.**\n\n### Brief (always loaded)\n\nThe brief is the lean working state — who they are now in your story, key deviations from source, active goals. Keep it under a page. This is what gets loaded every time a character appears.\n\n### Extended files (loaded on demand)\n\nWhen an entry develops depth that doesn't belong in every scene, split it into extended files:\n\n- **Characters**: `voice-samples` (dialogue examples), `source-comparison` (your version vs. original), `relationships`, `arc-notes`\n- **Canon Deviations**: `downstream-effects` (full ripple analysis), `reader-notes` (disclosure planning)\n- **Source Reference**: `quotes` (exact source citations), `timeline` (chronological event tracking)\n\nLoad extended files via path notation in get_context: `canon: [\"harry/voice-samples\"]`\n\nMigration is automatic — writing an extended file to a flat entry converts it to directory format.\n\n### Meta vs. Markdown\n\nThe `.meta.json` sidecar is the tool's filing system — `appears_in`, `role`, `type`, `last_updated`. It's navigation data.\n\nEverything a writer or AI needs to write a scene belongs in the markdown — personality, voice, appearance, arc, constraints, relationships.\n\nIf the tool disappeared tomorrow, the meta is the part you'd throw away. The markdown stands on its own.\n"
}
