{
  "id": "fiction-default",
  "name": "Fiction (Default)",
  "description": "Standard fiction setup — characters and locations. Works for literary fiction, thrillers, romance, memoir-as-fiction, and most narratives.",
  "canon_types": [
    {
      "id": "characters",
      "label": "Characters",
      "description": "People in the story — protagonists, antagonists, supporting cast"
    },
    {
      "id": "locations",
      "label": "Locations",
      "description": "Places where scenes happen — cities, rooms, landscapes"
    }
  ],
  "themes": [
    "identity",
    "power",
    "connection"
  ],
  "guide": "# Fiction Canon Guide\n\n## Characters\n\nOne file per named character. The filename is the character ID used in beat metadata.\n\n### What to include\n\n- **Core facts**: Age, appearance, occupation, role in the story\n- **Voice**: How they talk — sentence length, vocabulary, verbal tics, what they avoid saying\n- **Personality**: Not adjectives — show it through default reactions. \"When cornered, she deflects with humor\" beats \"she is funny\"\n- **Arc trajectory**: Where they start emotionally, where they're headed, what has to break for them to change\n- **Constraints**: Things this character would *never* do — these are more useful than what they would do\n- **Relationships**: Who matters to them and why, described from their POV\n- **Secrets**: What they know that others don't, and what they don't know about themselves\n\n### What to avoid\n\n- Exhaustive physical descriptions (readers build their own image from a few key details)\n- Backstory dumps — only include history that actively drives present behavior\n- Trait lists without behavioral anchors\n\n## Locations\n\nOne file per significant location. Locations are not backdrops — they shape what characters do and feel.\n\n### What to include\n\n- **Physical layout**: Just enough to block scenes — where doors are, what's visible, where someone could hide\n- **Atmosphere**: Time of day, light quality, temperature, ambient sound\n- **Sensory signature**: The one detail that makes this place *this* place (the smell of chlorine, the hum of fluorescents)\n- **Emotional register**: What mood does this location push scenes toward? A kitchen argument hits different than a parking lot argument\n- **Rules**: What can and can't happen here — a library enforces quiet, a bar loosens tongues\n- **History**: Only if characters know it and it affects how they behave in the space\n\n## Brief vs. Extended Files\n\nCanon entries support two tiers. **Most beats should be writable from briefs alone.**\n\n### Brief (always loaded)\n\nThe brief is the lean working state — identity, voice, current state, active goals, key dynamics. Keep it under a page. This is what gets loaded every time a character appears in a scene.\n\n### Top-matter is the brief\n\nThe text between `# Title` and the first `## Section` is what every `get_context` call returns without lazy-loading. It should be a self-contained summary — physical identity, story function, thematic purpose, arc in miniature. Scale to narrative weight:\n\n- **Protagonists / antagonists** (appear in most parts, carry full arcs): 3–4 paragraphs. Pre-state, transformation, resolution.\n- **Supporting cast** (appear in multiple parts, have specific functions): 1–2 paragraphs. Who they are, what they do, why they matter.\n- **Thematic infrastructure** (represent ideas more than people): 1 tight paragraph. What they are, where they appear, what they mean.\n\nThe test: if someone pulls this entry without loading any sections, do they know enough to write a scene? If yes, your top-matter is right.\n\n### Extended files (loaded on demand)\n\nWhen a character or location develops depth that doesn't belong in every scene, split it into extended files:\n\n- **Characters**: `voice-samples` (dialogue examples), `backstory` (history, formative events), `relationships` (detailed dynamics with all named characters), `arc-notes` (long-form arc planning)\n- **Locations**: `history` (detailed past), `layout` (maps, room-by-room), `atmosphere-notes` (sensory details by time/season)\n\nLoad extended files via path notation in get_context: `canon: [\"unit-7/voice-samples\"]`\n\nMigration is automatic — writing an extended file to a flat entry converts it to directory format.\n\n### Meta vs. Markdown\n\nThe `.meta.json` sidecar is the tool's filing system — `appears_in`, `role`, `type`, `last_updated`. It's navigation data.\n\nEverything a writer or AI needs to write a scene belongs in the markdown — personality, voice, appearance, arc, constraints, relationships.\n\nIf the tool disappeared tomorrow, the meta is the part you'd throw away. The markdown stands on its own.\n"
}
