{
  "id": "litrpg",
  "name": "LitRPG / GameLit",
  "description": "For progression fantasy, LitRPG, and GameLit — stories where characters level up, acquire items, and interact with game-like systems.",
  "canon_types": [
    {
      "id": "characters",
      "label": "Characters",
      "description": "People in the story — include stats, class, level, and abilities alongside personality"
    },
    {
      "id": "locations",
      "label": "Locations",
      "description": "Places where scenes happen — dungeons, towns, zones, instances"
    },
    {
      "id": "systems",
      "label": "Systems",
      "description": "Game mechanics — classes, leveling rules, stat calculations, skill trees, crafting"
    },
    {
      "id": "factions",
      "label": "Factions",
      "description": "Guilds, parties, kingdoms, monster factions — any group with collective goals"
    },
    {
      "id": "items",
      "label": "Items",
      "description": "Weapons, armor, consumables, artifacts — anything with stats or narrative significance"
    },
    {
      "id": "bestiary",
      "label": "Bestiary",
      "description": "Monsters, bosses, and creatures — stats, behavior, loot, and ecological role"
    }
  ],
  "themes": [
    "growth through adversity",
    "the grind vs. the shortcut",
    "what power costs"
  ],
  "guide": "# LitRPG Canon Guide\n\nLitRPG lives or dies on two things: **satisfying progression** and **actual characters**. The stat sheet is the hook, but the story is why readers stay. Every system entry should create interesting decisions, not just bigger numbers.\n\n## Characters\n\nOne file per named character. This is still fiction — lead with personality, not stats.\n\n- **Who they are**: Personality, voice, fears, goals. A min-maxer and a roleplayer approach the same dungeon differently\n- **Build philosophy**: How they think about their character build. Are they meta-gaming, going by instinct, following a guide, or doing something weird?\n- **Class and level**: Current class, level, and specialization path\n- **Key stats**: Only the stats that matter for story beats. Don't track 20 attributes if 4 drive the plot\n- **Signature abilities**: The 3-5 skills that define their combat style. Include cooldowns/costs that create tactical decisions\n- **Progression trajectory**: Where they're headed. What's the next milestone the reader should anticipate?\n- **Inventory highlights**: Link to items canon for details. Only mention what they actively use or what's narratively loaded\n- **Party role**: Tank, DPS, healer, utility — and how they feel about it\n\n### Stat block format\n\nKeep a consistent format across characters. Example:\n\n```\nClass: Shadow Archer (Lv. 34)\nHP: 2,140 / MP: 890\nSTR: 28 | AGI: 67 | INT: 41 | VIT: 32 | LCK: 19\nActive: [Phantom Shot] [Shadow Step] [Veil of Dusk]\nPassive: [Eagle Eye] [Silent Draw]\n```\n\nUpdate the stat block when levels change. Note the chapter/beat where the change happened.\n\n## Locations\n\nOne file per significant area. Locations in LitRPG are often mechanical as well as atmospheric.\n\n- **Description and atmosphere**: It's still a place, not just a game level. What does it feel like to stand here?\n- **Level range**: Recommended level, and what happens if you're underlevel\n- **Zone mechanics**: Environmental hazards, buffs/debuffs, special rules (no magic zones, gravity shifts, time limits)\n- **Monster population**: What spawns here, respawn rates, patrol patterns\n- **Points of interest**: Boss rooms, safe zones, merchants, hidden areas, puzzle triggers\n- **Loot profile**: What drops here that's worth farming for. Rare spawns or unique drops\n- **Connections**: Adjacent zones, fast travel points, secret passages\n- **History**: Lore for the area — why it exists, who built it, what happened here. Players discover this through environmental storytelling\n\n## Systems\n\nOne file per game mechanic. **This is the contract with your reader.** Internal consistency here is non-negotiable — your audience will find the math errors.\n\n- **Core mechanic**: How it works in plain language first, then specifics\n- **Formulas**: If damage = ATK * 1.5 - DEF * 0.8, write it down. You'll forget otherwise\n- **Progression curve**: How does this system scale? Linear, exponential, logarithmic? Progression that feels good usually has diminishing returns with punctuated breakthroughs\n- **Decision points**: Where does the player make meaningful choices? A skill tree with one viable path isn't a choice\n- **Interaction with other systems**: How does crafting interact with combat? How do class abilities interact with item enchantments?\n- **Edge cases**: What happens at level 1? At level 100? When two conflicting buffs stack? Define these before they come up in the story\n- **Exploit potential**: If a clever reader could break this system, your protagonist (or antagonist) should find it too. Pre-think the cheese strategies\n- **UI/UX**: How do characters see this information? Status screens, floating damage numbers, notification chimes? Be consistent about what the system interface looks like\n\n## Factions\n\nOne file per guild, party, or organization.\n\n- **Type**: Player guild, NPC kingdom, monster horde, merchant consortium\n- **Leadership and ranks**: Guild master, officers, rank requirements\n- **Territory**: What they control — zones, dungeons, trade routes, spawn points\n- **Specialization**: PvP focused? Raid guild? Crafting monopoly? Casual social?\n- **Resources**: Guild bank, shared storage, exclusive crafting stations, territory buffs\n- **Recruitment**: Requirements, initiation, what happens if you leave or get kicked\n- **Rivalries**: Named conflicts with other factions. Include stakes — what each side loses if they lose\n- **Internal politics**: Power struggles, cliques, the difference between what leadership says and what members experience\n\n## Items\n\nOne file per significant item or item category. Items are progression made tangible.\n\n- **Name and rarity**: Common / Uncommon / Rare / Epic / Legendary / Unique (or your tier system)\n- **Stats and effects**: Be specific. \"+15% crit rate\" not \"increases critical hits\"\n- **Requirements**: Level, class, stat minimums, quest prerequisites\n- **How obtained**: Drop source, crafting recipe, quest reward, shop purchase. Rare items need a story\n- **Current owner**: Who has it now, and how they got it\n- **Set bonuses**: If part of a set, what's the bonus and what's missing\n- **Narrative weight**: Beyond stats — is it a symbol, a mcguffin, a source of conflict? The best items are ones characters fight over\n- **Upgrade path**: Can it evolve, be enchanted, or be socketed? What's the ceiling?\n\n## Bestiary\n\nOne file per monster type or significant individual boss.\n\n- **Name and tier**: Mob, elite, mini-boss, boss, raid boss, world boss\n- **Stats**: HP, damage range, key resistances/weaknesses\n- **Behavior pattern**: Aggro range, attack rotation, phase transitions for bosses\n- **Abilities**: Named attacks with descriptions. \"Tail Swipe (cone AoE, knockback, 3s cooldown)\"\n- **Weaknesses and resistances**: What elements/damage types they're vulnerable or immune to\n- **Loot table**: What they drop and at what rates. Tie rare drops to narrative moments\n- **Ecology**: Where they live, what they eat, how they interact with other monsters. This informs encounter design\n- **Lore**: Why they exist. Created by a god? Corrupted animals? Magical experiment gone wrong?\n- **Strategy notes**: How parties typically fight them. This helps you write combat scenes that feel tactical\n\n## Brief vs. Extended Files\n\nCanon entries support two tiers. **Most beats should be writable from briefs alone.**\n\n### Brief (always loaded)\n\nThe brief is the lean working state — current stats, active abilities, key relationships. Keep it under a page. This is what gets loaded every time an entry is referenced in a scene.\n\n### Extended files (loaded on demand)\n\nWhen an entry develops depth that doesn't belong in every scene, split it into extended files:\n\n- **Characters**: `stat-history` (level-by-level progression), `build-notes` (theory-crafting), `voice-samples`, `relationships`\n- **Locations**: `loot-tables`, `mob-spawns`, `puzzle-guides`, `history`\n- **Systems**: `formulas` (exact calculations), `edge-cases`, `exploit-log`\n- **Items**: `upgrade-path`, `lore`, `stat-comparisons`\n- **Bestiary**: `strategy-guide`, `loot-table`, `lore`, `variants`\n\nLoad extended files via path notation in get_context: `canon: [\"shadow-archer/stat-history\"]`\n\nMigration is automatic — writing an extended file to a flat entry converts it to directory format.\n"
}
