{
  "id": "worldbuilding",
  "name": "Worldbuilding",
  "description": "For stories with invented worlds, complex politics, or deep lore — epic fantasy, sci-fi, alternate history.",
  "canon_types": [
    {
      "id": "characters",
      "label": "Characters",
      "description": "People in the story — protagonists, antagonists, supporting cast"
    },
    {
      "id": "locations",
      "label": "Locations",
      "description": "Places where scenes happen — cities, dungeons, planets, rooms"
    },
    {
      "id": "factions",
      "label": "Factions",
      "description": "Groups, organizations, nations, guilds — any collective with goals and structure"
    },
    {
      "id": "lore",
      "label": "Lore",
      "description": "History, mythology, cosmology, legends — the backstory of the world itself"
    },
    {
      "id": "systems",
      "label": "Systems",
      "description": "Rules that govern the world — magic systems, technology, economies, laws of nature"
    }
  ],
  "themes": [
    "power and corruption",
    "legacy",
    "the cost of progress"
  ],
  "guide": "# Worldbuilding Canon Guide\n\nThe cardinal rule: **worldbuilding serves story**. Every canon entry should connect to something a character experiences on the page. If a fact about the world never creates tension, wonder, or consequence for a character, it belongs in your head, not in canon.\n\n## Characters\n\nOne file per named character. Include everything from the fiction-default guide, plus:\n\n- **Cultural context**: How their upbringing, faction, and social position shape their worldview\n- **Relationship to power**: Where they sit in the world's hierarchies — and whether they accept it\n- **System interaction**: How they use (or are used by) the world's magic, technology, or politics\n- **What they believe about the world**: Their personal cosmology, superstitions, received wisdom — especially where it's wrong\n\n## Locations\n\nOne file per significant place. Include:\n\n- **Geography and scale**: Mountains don't move between chapters. Pin down distances, climate, and terrain\n- **Who controls it**: Political ownership, military presence, disputed claims\n- **Economy**: What's produced, traded, or fought over here. Resources drive conflict\n- **Atmosphere by time**: How the location feels at dawn vs. midnight, in peace vs. wartime\n- **Layers**: What's visible to a visitor vs. what locals know. The tourist sees the market; the local knows which stalls are fronts\n- **Connections**: Travel routes, borders, what's a day's ride away\n\n## Factions\n\nOne file per group or organization. Factions are the engines of political plot.\n\n- **Structure**: Leadership, ranks, how decisions get made. A democracy moves differently than a cult of personality\n- **Goals**: What they want — stated publicly and what leadership actually pursues\n- **Methods**: How they operate. Diplomacy, espionage, open warfare, economic pressure\n- **Resources**: Money, territory, magic, manpower, information — what gives them leverage\n- **Internal tensions**: No faction is monolithic. Where are the fault lines? Who's a reformer, who's a hardliner?\n- **Relationships**: Allies, enemies, and the complicated ones. Use a simple matrix if needed\n- **Recruitment**: How do you join? How do you leave? (Can you leave?)\n- **Self-image vs. reality**: How a member would describe the faction vs. how their enemies would\n\n## Lore\n\nOne file per historical event, myth, or cosmological concept. Lore is backstory with narrative weight.\n\n- **The event**: What happened — or what people believe happened\n- **Multiple versions**: Different factions remember history differently. Track the dominant narrative and the suppressed ones\n- **Present consequences**: How this event shapes current politics, grudges, alliances, or fears\n- **What characters know**: Tag which characters have access to which version of events\n- **Truth status**: Is the myth literally true, metaphorically true, propaganda, or unknown even to the author?\n- **Artifacts**: Objects, ruins, traditions, or phrases that survive from this era. These are your exposition vehicles — characters can encounter a ruin without you writing a history lecture\n\n## Systems\n\nOne file per system (magic, technology, economy, etc.). Systems are the physics of your world.\n\n- **Rules**: How it works. Be specific enough that you can't cheat. \"Magic costs life force\" means you need to define how much, or readers will notice when it's convenient\n- **Costs and limits**: The most important part. Superman is boring; kryptonite makes stories. Define what the system *cannot* do\n- **Access**: Who can use it? Is it innate, learned, inherited, purchased? Access inequality is a plot engine\n- **Social impact**: How has this system shaped the world? If everyone can do telekinesis, architecture looks different. If only nobles can, revolution looks likely\n- **Edge cases**: What happens at the boundaries? When two systems interact? When someone tries to break the rules?\n- **Sensory experience**: What does it look, sound, smell, feel like when active? Make it visceral, not clinical\n- **History**: Has the system always worked this way, or has it changed? Are there lost techniques?\n"
}
